[
  {
    "contents": "<p>Overview: <p>SimVentions is a 100% employee-owned business and has consistently been voted one of Virginia's Best Places to Work. We are seeking a Helpdesk Support Specialist to join our team!</p><p>&nbsp;</p><p>As an IT Help Desk Support Specialist II, the candidate will provide technical assistance and training to system users. The candidate will respond to users' request for assistance by phone, in person, or via help desk ticket, generally handling routine technical issues while seeking guidance on more complex issues. The candidate will apply basic diagnostic techniques to identify problems, investigate causes, and recommend solutions to correct common failures. The candidate will maintain the helpdesk system and ensure technical support issues are escalated to the appropriate level for resolution. The candidate will install and modify corporate computers and associated network hardware, software, and peripherals. The candidate will diagnose hardware and software, and operator problems, taking remedial actions or recommends procedural changes. The candidate will create new user accounts and build new laptops, loading and configuring operating systems and applications. The candidate will provide meeting support and technical A/V support for in-person, hybrid, and virtual meetings.</p> Travel: 1 day a week to Dahlgren office Clearance: <p><span>Ability to obtain a secret security clearance is required.&nbsp;</span></p> Requirements: <ul><li>2+ years experience working in a customer facing technical support environment</li><li>A solid understanding of hardware, software, and network systems, including troubleshooting common technical issues</li><li>Proficiency in troubleshooting A/V equipment, including projectors, displays, microphones, and sound systems</li><li>Strong knowledge of video conferencing platforms such as Microsoft Teams and Cisco Webex</li><li>Ability to work flexible hours as necessary</li><li>Willingness to collaborate with team members and escalate issues to higher levels of support when necessary</li><li>Capability to handle multiple support inquiries simultaneously while maintaining accuracy and a high level of customer satisfaction</li><li>Ability to receive input from various sources, effectively prioritize tasks, and successfully complete them within a specified timeframe</li><li>Excellent verbal and written communication skills</li><li>Strong interpersonal and communication skills to provide excellent customer support while remaining patient and empathetic</li></ul> Responsibilities: <ul><li>Assist with managing the helpdesk ticket queue on a daily basis; creating, routing, and remedying tickets in a timely manner.</li><li>Answer queries by telephone or self-service ticket in support of internal and/or outside customer computer hardware, software, network, system/application access, and telecommunications systems.</li><li>Troubleshoot configuration issues, software installations, hardware repair (including inhouse repair or coordinating depot or warranty services) to support day-to‐day operations.</li><li>Test new hardware and software systems and packages prior to deployment.</li><li>Perform support to the user check‐in process, performing functions such as: account creation; processing new account paperwork; issuing credentials; assigning permissions; and providing new hire onboarding brief.</li><li>Deploy images and configure new system buildouts for new hires. Work directly with hiring managers to ensure proper equipment and access.</li><li>Coordinate and resolve technical, scheduling, and delivery issues associated with technical refresh, asset tracking, and life‐cycle sustainment.</li><li>Manage and track all issued, reclaimed, removed, and relocated capital IT assets.</li><li>Compose instructional documentation and videos to provide end-users with step-by-step processes on the proper method to utilize specific hardware and software.</li><li>Complete market research and submit purchase requests for equipment needs.</li><li>Provides meeting support and technical A/V support for in-person, hybrid, and virtual meetings.</li><li>Troubleshoot and resolve A/V equipment problems, such as projectors, displays, microphones, and sound systems.</li><li>Assist with video conferencing setup, configuration, and troubleshooting (e.g., Microsoft Teams and Cisco WebEx).</li><li>Create and update documentation related to A/V equipment, configurations, and troubleshooting procedures.</li><li>Provide training and guidance to end-users on the proper use of A/V equipment and video conferencing tools.</li><li>Alerts management to recurring problems and patterns of problems. Provides recommendations to resolve problems.</li><li>Provides an outstanding customer service experience in a variety of circumstances across all organizational levels.</li><li>Various projects and tasking as assigned.</li></ul> Preferred Skills and Experience: <ul><li>Experience with Microsoft O365</li><li>Proficiency with Windows Operating Systems</li><li>Proficiency with the Zendesk help desk system</li><li>Proficiency with Active Directory</li></ul> Education: GED or High School Diploma Compensation: <p><span><span>Compensation at SimVentions is determined by a number of factors, including, but not limited to, the candidate’s experience, education, training, security clearance, work location, skills, knowledge, and competencies, as well as alignment with our corporate compensation plan and contract specific requirements.</span></span></p><p>&nbsp;</p><p><span>The projected annual compensation range for this position is $50,000 - $65,000 (USD). This estimate reflects the standard salary range for this position and is just one component of the total compensation package that SimVentions offers.&nbsp;</span></p> Benefits: <p>At SimVentions, we’re committed to supporting the total well-being of our employees and their families. Our benefit offerings include comprehensive health and welfare plans to serve a variety of needs.&nbsp;</p><p><br>We offer:</p><p>&nbsp;</p><ul><li>Medical, dental, vision, and prescription drug coverage</li><li>Employee Stock Ownership Plan (ESOP)</li><li>Competitive 401(k) programs</li><li>Retirement and Financial Counselors</li><li>Health Savings and Health Reimbursement Accounts</li><li>Flexible Spending Accounts</li><li>Life insurance, short- &amp; long-term disability</li><li>Continuing Education Assistance</li><li>Paid Time Off, Paid Holidays, Paid Leave (e.g., Maternity, Paternity, Jury Duty, Bereavement, Military)</li><li>Third Party Employee Assistance Program that offers emotional and lifestyle well-being services, to include free counseling</li><li>Supplemental Benefit Program&nbsp;</li></ul> Why Work for SimVentions?: <p>SimVentions is about more than just being a place to work with other growth-orientated technically exceptional experts. It’s also a fun place to work. Our family-friendly atmosphere encourages our employee-owners to imagine, create, explore, discover, and do great things together.</p><p>&nbsp;</p><p><strong>Support Our Warfighters</strong></p><p>&nbsp;</p><p>SimVentions is a proud supporter of the U.S. military, and we take pride in our ability to provide relevant, game-changing solutions to our armed men and women around the world.</p><p>&nbsp;</p><p><strong>Drive Customer Success</strong></p><p>&nbsp;</p><p>We deliver innovative products and solutions that go beyond the expected. This means you can expect to work with a team that will allow you to grow, have a voice, and make an impact.<br><br><strong>Get Involved in Giving Back</strong></p><p>&nbsp;</p><p>We believe a well-rounded company starts with well-rounded employees, which is why we offer diverse service opportunities for our team throughout the year.</p><p>&nbsp;</p><p><strong>Build Innovative Technology</strong></p><p>&nbsp;</p><p>SimVentions takes pride in its innovative and cutting-edge technology, so you can be sure that whatever project you work on, you will be having a direct impact on our customer’s success.</p><p>&nbsp;</p><p><strong>Work with Brilliant People</strong></p><p>&nbsp;</p><p>We don’t just hire the smartest people; we seek experienced, creative individuals who are passionate about their work and thrive in our unique culture.</p><p>&nbsp;</p><p><strong>Create Meaningful Solutions</strong></p><p>&nbsp;</p><p>We are trusted partners with our customers and are provided challenging and meaningful requirements to help them solve.</p><p>&nbsp;</p><p><strong>Employees who join SimVentions will enjoy additional perks like:</strong></p><ul><li><strong>Employee Ownership:</strong><span>&nbsp;</span>Work with the best and help build YOUR company!</li><li><strong>Family focus:</strong><span>&nbsp;</span>Work for a team that recognizes the importance of family time.</li><li><strong>Culture:</strong><span>&nbsp;</span>Add to our culture of technical excellence and collaboration.</li><li><strong>Dress code:</strong><span>&nbsp;</span>Business casual, we like to be comfortable while we work.</li><li><strong>Resources:</strong>&nbsp; Excellent facilities, tools, and training opportunities to grow in your field.</li><li><strong>Open communication:</strong><span>&nbsp;</span>Work in an environment where your voice matters.</li><li><strong>Corporate Fellowship:</strong>&nbsp; Opportunities to participate in company sports teams and employee-led interest groups for personal and professional development.</li><li><strong>Employee Appreciation:<span>&nbsp;</span></strong>Multiple corporate events throughout the year, including Holiday Events, Company Picnic, Imagineering Day, and more.</li><li><strong>Founding Partner of the FredNats Baseball team:</strong><span>&nbsp;</span>Equitable distribution of tickets for every home game to be enjoyed by our employee-owners and their families from our private suite.</li><li><strong>Food:</strong><span>&nbsp;</span>We have a lot of food around here!</li></ul><p>&nbsp;</p><p>FTAC</p></p>",
    "name": "IT/Helpdesk Support Specialist",
    "type": "external",
    "publication_date": "2025-04-16T21:57:25Z",
    "short_name": "ithelpdesk-support-specialist-6d050b",
    "model_type": "jobs",
    "id": 18550871,
    "locations": [
      {
        "name": "Manassas, VA"
      }
    ],
    "categories": [
      {
        "name": "Computer and IT"
      }
    ],
    "levels": [
      {
        "name": "Mid Level",
        "short_name": "mid"
      }
    ],
    "tags": [],
    "refs": {
      "landing_page": "https://www.themuse.com/jobs/simventionsincglassdoor46/ithelpdesk-support-specialist-6d050b"
    },
    "company": {
      "id": 15000709,
      "short_name": "simventionsincglassdoor46",
      "name": "SimVentions, Inc - Glassdoor ✪ 4.6"
    }
  },
  {
    "contents": "<p>Overview: <div><p><span>Vi is recognized as a Great Place to Work and one of Glassdoor's 100 Best Companies to work for. Learn from the best and accelerate your career with Vi.</span></p><p><strong><span>What We Offer: </span></strong></p><ul><li><span>Competitive pay</span></li><li><span>Exceptional benefits</span></li><li><span>Generous Paid Time Off - start accruing on day one</span></li><li><span>401k with company match</span></li><li><span>Paid maternity and paternity benefits</span></li><li><span>Award-winning training and development</span></li><li><span>Tuition Reimbursement</span></li><li><span>Luxury work environment</span></li><li><span>Meaningful and rewarding work</span></li></ul><p>&nbsp;</p><p>Vi at Palo Alto is located at 620 Sand Hill Road, Palo Alto CA 94304</p></div> Responsibilities: <p><span>The Community Technology Support Coordinator provides technical support for residents and staff in using computer hardware and software based on self-direction and prioritization of various community needs. This role also supports community-based technologies such as A/V in the building. Duties are as follows:</span></p><p>&nbsp;</p><p><span><strong>Resident Technology Support</strong></span></p><ul><li><span>Serves as the first point of contact for residents seeking technical assistance on a scheduled basis. Maintains hours of operations and schedule.</span></li><li><span>Assists residents with set up, training and troubleshooting on personal devices including, but not limited to smart phones, tablets/iPads, computer, home Wi-Fi, and voice assistant devices.</span></li><li><span>Provides education, training and support on technology applications and platforms such as email, Touchtown, work order requests, reservations, virtual communication, cyber security, etc.</span></li><li><span>Prepares, schedules, and conducts resident technology education, training, webinars and seminars, both in-person and virtual settings.</span></li><li><span>Manages and coordinates other resident technology support resources as needed.</span></li><li><span>Captures various data metrics including usage and satisfaction to determine effectiveness of scheduling and responding to resident technology support requests.</span></li></ul><p><span><strong>Staff Technology Support</strong></span></p><ul><li><span>Serves as the onsite point of escalation for staff technology support tickets coming from the IT helpdesk or corporate IT support staff.</span></li><li><span>Assists community staff with hardware and software-related technology troubleshooting including, but not limited to, PC and peripherals, mobile device, and business applications.</span></li><li><span>Addresses support requests/tickets in a timely and customer-friendly manner.</span></li><li><span>Logs and fully documents support requests in the help desk ticket system; updates daily status of support tickets.</span></li><li><span>In emergency situations, serves as first-point-of-contact and corporate liaison.</span></li></ul><ul><li><span>Captures various data metrics including usage and satisfaction to determine effectiveness of scheduling and responding to staff technology support requests. </span></li><li><span>Participates in regular status calls and reviewing reports, working with Corporate IT Support Manager.</span></li></ul><p><span>&nbsp;</span></p><p><span><strong>Community Technology Support</strong></span></p><ul><li><span>Supports various technologies in community spaces such as the Theatre, Multi-purpose room, Computer Center. Technology examples include A/V, In-house channel, Digital Signage.</span></li><li><span>Serves as point of contact for various corporate technology projects and initiatives.</span></li></ul> Qualifications: <p><span><strong>Key Competencies:</strong></span></p><ul><li><span>Strong technical proficiency and excellent working knowledge of various computer hardware technologies, software applications, mobile devices, and other technology products including audio visual (A/V) systems.</span></li><li><span>Ability to schedule, self-manage and prioritize requests from residents and staff.</span></li><li><span>Ability to quickly learn and utilize new technologies.</span></li><li><span>Excellent troubleshooting, break/fix skills.&nbsp; Persistence and follow-through required.</span></li><li><span>Outstanding customer service skills, especially with older adults.</span></li><li><span>Excellent verbal and written communication skills, along with effective listening. Strong people skills required for relationship building.</span></li><li><span>Ability to effectively create and teach in-person classroom and virtual training (in collaboration/partnership with Lifestyle team leaders).</span></li><li><span>Demonstrated ability to manage multiple, parallel assignments with accountability for timely delivery results.&nbsp; Ability to multi-task projects and assignments in a timely manner.</span></li></ul><p><span><strong>Education and Experience:</strong></span></p><p><span><strong>&nbsp;</strong></span></p><ul><li><span><strong>Education: </strong>Associate’s or Bachelor’s degree in Computer Science, Information Technology, or related technology field is preferred.</span></li><li><span><strong>Work Experience: &nbsp;</strong>Minimum 1 year of user support and training experience is required.</span></li></ul><ul><li><span>A solid working knowledge of computer hardware, software, and peripherals including installation, configuration, maintenance and support is required.</span></li></ul><ul><li><span><strong>Licensure / Certification: </strong>Microsoft, A+ or other technology certifications preferred.</span></li></ul> Pay Range: USD $33.01 - USD $41.27 /Hr.</p>",
    "name": "IT/AV Support Coordinator",
    "type": "external",
    "publication_date": "2025-04-10T03:49:58Z",
    "short_name": "itav-support-coordinator-c62904",
    "model_type": "jobs",
    "id": 18471576,
    "locations": [
      {
        "name": "San Francisco, CA"
      }
    ],
    "categories": [
      {
        "name": "Computer and IT"
      }
    ],
    "levels": [
      {
        "name": "Mid Level",
        "short_name": "mid"
      }
    ],
    "tags": [],
    "refs": {
      "landing_page": "https://www.themuse.com/jobs/viliving/itav-support-coordinator-c62904"
    },
    "company": {
      "id": 15000753,
      "short_name": "viliving",
      "name": "Vi Living"
    }
  },
  {
    "contents": "<p>Overview: <div><p><span>Vi is recognized as a Great Place to Work and one of Glassdoor's 100 Best Companies to work for. Learn from the best and accelerate your career with Vi.</span></p><p><strong><span>What We Offer: </span></strong></p><ul><li><span>Competitive pay</span></li><li><span>Exceptional benefits</span></li><li><span>Generous Paid Time Off - start accruing on day one</span></li><li><span>401k with company match</span></li><li><span>Paid maternity and paternity benefits</span></li><li><span>Award-winning training and development</span></li><li><span>Tuition Reimbursement</span></li><li><span>Luxury work environment</span></li><li><span>Meaningful and rewarding work</span></li></ul><p>&nbsp;</p><p>Vi at Palo Alto is located at 620 Sand Hill Road, Palo Alto CA 94304</p></div> Responsibilities: <p><span>The Community Technology Support Coordinator provides technical support for residents and staff in using computer hardware and software based on self-direction and prioritization of various community needs. This role also supports community-based technologies such as A/V in the building. Duties are as follows:</span></p><p>&nbsp;</p><p><span><strong>Resident Technology Support</strong></span></p><ul><li><span>Serves as the first point of contact for residents seeking technical assistance on a scheduled basis. Maintains hours of operations and schedule.</span></li><li><span>Assists residents with set up, training and troubleshooting on personal devices including, but not limited to smart phones, tablets/iPads, computer, home Wi-Fi, and voice assistant devices.</span></li><li><span>Provides education, training and support on technology applications and platforms such as email, Touchtown, work order requests, reservations, virtual communication, cyber security, etc.</span></li><li><span>Prepares, schedules, and conducts resident technology education, training, webinars and seminars, both in-person and virtual settings.</span></li><li><span>Manages and coordinates other resident technology support resources as needed.</span></li><li><span>Captures various data metrics including usage and satisfaction to determine effectiveness of scheduling and responding to resident technology support requests.</span></li></ul><p><span><strong>Staff Technology Support</strong></span></p><ul><li><span>Serves as the onsite point of escalation for staff technology support tickets coming from the IT helpdesk or corporate IT support staff.</span></li><li><span>Assists community staff with hardware and software-related technology troubleshooting including, but not limited to, PC and peripherals, mobile device, and business applications.</span></li><li><span>Addresses support requests/tickets in a timely and customer-friendly manner.</span></li><li><span>Logs and fully documents support requests in the help desk ticket system; updates daily status of support tickets.</span></li><li><span>In emergency situations, serves as first-point-of-contact and corporate liaison.</span></li></ul><ul><li><span>Captures various data metrics including usage and satisfaction to determine effectiveness of scheduling and responding to staff technology support requests. </span></li><li><span>Participates in regular status calls and reviewing reports, working with Corporate IT Support Manager.</span></li></ul><p><span>&nbsp;</span></p><p><span><strong>Community Technology Support</strong></span></p><ul><li><span>Supports various technologies in community spaces such as the Theatre, Multi-purpose room, Computer Center. Technology examples include A/V, In-house channel, Digital Signage.</span></li><li><span>Serves as point of contact for various corporate technology projects and initiatives.</span></li></ul> Qualifications: <p><span><strong>Key Competencies:</strong></span></p><ul><li><span>Strong technical proficiency and excellent working knowledge of various computer hardware technologies, software applications, mobile devices, and other technology products including audio visual (A/V) systems.</span></li><li><span>Ability to schedule, self-manage and prioritize requests from residents and staff.</span></li><li><span>Ability to quickly learn and utilize new technologies.</span></li><li><span>Excellent troubleshooting, break/fix skills.&nbsp; Persistence and follow-through required.</span></li><li><span>Outstanding customer service skills, especially with older adults.</span></li><li><span>Excellent verbal and written communication skills, along with effective listening. Strong people skills required for relationship building.</span></li><li><span>Ability to effectively create and teach in-person classroom and virtual training (in collaboration/partnership with Lifestyle team leaders).</span></li><li><span>Demonstrated ability to manage multiple, parallel assignments with accountability for timely delivery results.&nbsp; Ability to multi-task projects and assignments in a timely manner.</span></li></ul><p><span><strong>Education and Experience:</strong></span></p><p><span><strong>&nbsp;</strong></span></p><ul><li><span><strong>Education: </strong>Associate’s or Bachelor’s degree in Computer Science, Information Technology, or related technology field is preferred.</span></li><li><span><strong>Work Experience: &nbsp;</strong>Minimum 1 year of user support and training experience is required.</span></li></ul><ul><li><span>A solid working knowledge of computer hardware, software, and peripherals including installation, configuration, maintenance and support is required.</span></li></ul><ul><li><span><strong>Licensure / Certification: </strong>Microsoft, A+ or other technology certifications preferred.</span></li></ul> Pay Range: USD $33.01 - USD $41.27 /Hr.</p>",
    "name": "IT/AV Support Coordinator",
    "type": "external",
    "publication_date": "2025-04-10T03:49:58Z",
    "short_name": "itav-support-coordinator-9f01e2",
    "model_type": "jobs",
    "id": 18471733,
    "locations": [
      {
        "name": "San Leandro, CA"
      }
    ],
    "categories": [
      {
        "name": "Computer and IT"
      }
    ],
    "levels": [
      {
        "name": "Mid Level",
        "short_name": "mid"
      }
    ],
    "tags": [],
    "refs": {
      "landing_page": "https://www.themuse.com/jobs/viliving/itav-support-coordinator-9f01e2"
    },
    "company": {
      "id": 15000753,
      "short_name": "viliving",
      "name": "Vi Living"
    }
  },
  {
    "contents": "<p>At RapidScale, exceptional technology is powered by exceptional people. As a growing leader in secure, reliable managed cloud solutions, we help SMBs and enterprises alike simplify IT and unleash innovation. With a broad portfolio spanning AWS, Azure and Google to a full set of Private Cloud and Cybersecurity solutions, RapidScale helps companies turn technology into their biggest competitive advantage. As part of the Cox family of companies, we offer best-in-class benefits, a commitment to work-life balance, and an award-winning workplace experience.<br><br>Do you have a passion for cloud technology and building partnerships? We're looking for a Regional Partner Manager to join our cloud managed services sales team. In this role, you will be responsible for enabling a network of Cox Business (CB) sellers and engineers who can sell and deliver RapidScale's cloud services to their end customers. You will also work closely with internal teams to provide sales support, marketing resources and technical guidance to your CB partners.<br><br><strong> What You'll Do </strong><br><br>As a Regional Partner Manager, you will own revenue and growth opportunities in your assigned market. Your responsibilities include:<br><br><ul> <li> <strong> Channel Management </strong> : Collaborate with Cox Business sellers and sales leadership to manage and nurture CB relationships within assigned sales territory. </li> <li> <strong> Partner Strategy </strong> : Develop and maintain a strategic partner ecosystem, utilizing tools such as partner heatmaps to focus efforts on high-potential partnerships. </li> <li> <strong> Recruitment </strong> : Identify, recruit, and onboard new partners who align with RapidScale's vision and sales strategy. </li> <li> <strong> Sales Enablement </strong> : Equip partners with the resources they need to succeed, including sales training, co-marketing initiatives, and technical guidance. </li> <li> <strong> Engagement &amp; Collaboration </strong> : Lead initiatives to increase partner engagement, foster collaboration, and raise awareness of RapidScale's value proposition and product suite. </li> <li> <strong> Performance Monitoring: </strong> Track sales performance metrics, conduct regular reviews with partners, and identify areas for improvement to achieve growth targets. </li> <li> <strong> Go-To-Market Planning: </strong> Develop and execute joint sales plans with top-performing partners, establishing clear success metrics and objectives. </li> <li> <strong> Event Representation </strong> : Represent RapidScale at regional and national partner events, enhancing brand visibility and strengthening relationships. </li> <li> <strong> Cross-Team Collaboration </strong> : Work closely with internal sales, marketing, and technical teams to align efforts and deliver seamless support to partners. </li> </ul><br><br><strong> Who You Are </strong><br><br>With ambitious targets and quotas, you're a results-driven professional who thrives in a fast-paced, collaborative environment with a history of exceeding revenue targets and building high-performing partner ecosystems. You will have the following:<br><br><strong> Minimum Qualifications: </strong><br><br><ul> <li> Bachelor's degree with 6+ years of experience in managed IT services, or 10+ years of experience in lieu of a degree. </li> <li> Proven expertise in partner/channel management and supporting both indirect and direct sales teams. </li> <li> Experience working with cloud service providers or MSPs. </li> <li> Familiarity with partner incentive programs, co-selling initiatives, and partner marketing campaigns. </li> <li> Exceptional communication, presentation, and relationship-building skills, with the ability to analyze market trends and identify untapped opportunities for growth. </li> <li> Proficiency with tools like the Microsoft Office suite. </li> <li> Willingness and ability to travel up to 50% for events and partner meetings. </li> </ul><br><br><strong> Preferred Qualifications: </strong><br><br><ul> <li> Strong technical knowledge of DaaS, IaaS, DRaaS, O365, and SD-WAN.</li> </ul><br><br>USD 111,000.00 - 166,600.00 per year<br><br><strong>Compensation:</strong><br><br>Compensation includes a base salary of $111,000.00 - $166,600.00. The salary rate may vary within the anticipated range based on factors such as the ultimate location of the position and the selected candidate's experience. In addition to the salary range identified herein, this role is also eligible for an annual incentive/commission target of $90,000.00.<br><br><strong>Benefits:</strong><br><br>The Company offers eligible employees the flexibility to take as much vacation with pay as they deem consistent with their duties, the company's needs, and its obligations; seven paid holidays throughout the calendar year; and up to 160 hours of paid wellness annually for their own wellness or that of family members. Employees are also eligible for additional paid time off in the form of bereavement leave, time off to vote, jury duty leave, volunteer time off, military leave, and parental leave.<br><br>Applicants must currently be authorized to work in the United States for any employer without current or future sponsorship.<br><br><b>About Cox Communications</b><br><br>Cox Communications is the largest private telecom company in America, serving six million homes and businesses. That's a lot, but we also proudly serve our employees. Our benefits and our award-winning culture are just two of the things that make Cox a coveted place to work. If you're interested in bringing people closer through broadband, smart home tech and more, join Cox Communications today!<br><br><b>About Cox</b><br><br>Cox empowers employees to build a better future and has been doing so for over 120 years. With exciting investments and innovations across transportation, communications, cleantech and healthcare, our family of businesses - which includes Cox Automotive and Cox Communications - is forging a better future for us all. Ready to make your mark? Join us today!<br><br>Benefits of working at Cox may include health care insurance (medical, dental, vision), retirement planning (401(k)), and paid days off (sick leave, parental leave, flexible vacation/wellness days, and/or PTO). For more details on what benefits you may be offered, visit our benefits page .<br><br>Cox is an Equal Employment Opportunity employer - All qualified applicants/employees will receive consideration for employment without regard to that individual's age, race, color, religion or creed, national origin or ancestry, sex (including pregnancy), sexual orientation, gender, gender identity, physical or mental disability, veteran status, genetic information, ethnicity, citizenship, or any other characteristic protected by law.<br><br>Statement to ALL Third-Party Agencies and Similar Organizations: Cox accepts resumes only from agencies with which we formally engage their services. Please do not forward resumes to our applicant tracking system, Cox employees, Cox hiring manager, or send to any Cox facility. Cox is not responsible for any fees or charges associated with unsolicited resumes.</p>",
    "name": "Regional Partner Manager (RapidScale)",
    "type": "external",
    "publication_date": "2025-04-17T23:37:35Z",
    "short_name": "regional-partner-manager-rapidscale-36cbcd",
    "model_type": "jobs",
    "id": 18082415,
    "locations": [
      {
        "name": "El Cajon, CA"
      }
    ],
    "categories": [
      {
        "name": "Computer and IT"
      }
    ],
    "levels": [
      {
        "name": "Senior Level",
        "short_name": "senior"
      }
    ],
    "tags": [],
    "refs": {
      "landing_page": "https://www.themuse.com/jobs/coxcommunications/regional-partner-manager-rapidscale-36cbcd"
    },
    "company": {
      "id": 15000686,
      "short_name": "coxcommunications",
      "name": "Cox Communications"
    }
  },
  {
    "contents": "<p>Overview: <div><p><span>Vi is recognized as a Great Place to Work and one of Glassdoor's 100 Best Companies to work for. Learn from the best and accelerate your career with Vi.</span></p><p><strong><span>What We Offer: </span></strong></p><ul><li><span>Competitive pay</span></li><li><span>Exceptional benefits</span></li><li><span>Generous Paid Time Off - start accruing on day one</span></li><li><span>401k with company match</span></li><li><span>Paid maternity and paternity benefits</span></li><li><span>Award-winning training and development</span></li><li><span>Tuition Reimbursement</span></li><li><span>Luxury work environment</span></li><li><span>Meaningful and rewarding work</span></li></ul><p>&nbsp;</p><p>Vi at Palo Alto is located at 620 Sand Hill Road, Palo Alto CA 94304</p></div> Responsibilities: <p><span>The Community Technology Support Coordinator provides technical support for residents and staff in using computer hardware and software based on self-direction and prioritization of various community needs. This role also supports community-based technologies such as A/V in the building. Duties are as follows:</span></p><p>&nbsp;</p><p><span><strong>Resident Technology Support</strong></span></p><ul><li><span>Serves as the first point of contact for residents seeking technical assistance on a scheduled basis. Maintains hours of operations and schedule.</span></li><li><span>Assists residents with set up, training and troubleshooting on personal devices including, but not limited to smart phones, tablets/iPads, computer, home Wi-Fi, and voice assistant devices.</span></li><li><span>Provides education, training and support on technology applications and platforms such as email, Touchtown, work order requests, reservations, virtual communication, cyber security, etc.</span></li><li><span>Prepares, schedules, and conducts resident technology education, training, webinars and seminars, both in-person and virtual settings.</span></li><li><span>Manages and coordinates other resident technology support resources as needed.</span></li><li><span>Captures various data metrics including usage and satisfaction to determine effectiveness of scheduling and responding to resident technology support requests.</span></li></ul><p><span><strong>Staff Technology Support</strong></span></p><ul><li><span>Serves as the onsite point of escalation for staff technology support tickets coming from the IT helpdesk or corporate IT support staff.</span></li><li><span>Assists community staff with hardware and software-related technology troubleshooting including, but not limited to, PC and peripherals, mobile device, and business applications.</span></li><li><span>Addresses support requests/tickets in a timely and customer-friendly manner.</span></li><li><span>Logs and fully documents support requests in the help desk ticket system; updates daily status of support tickets.</span></li><li><span>In emergency situations, serves as first-point-of-contact and corporate liaison.</span></li></ul><ul><li><span>Captures various data metrics including usage and satisfaction to determine effectiveness of scheduling and responding to staff technology support requests. </span></li><li><span>Participates in regular status calls and reviewing reports, working with Corporate IT Support Manager.</span></li></ul><p><span>&nbsp;</span></p><p><span><strong>Community Technology Support</strong></span></p><ul><li><span>Supports various technologies in community spaces such as the Theatre, Multi-purpose room, Computer Center. Technology examples include A/V, In-house channel, Digital Signage.</span></li><li><span>Serves as point of contact for various corporate technology projects and initiatives.</span></li></ul> Qualifications: <p><span><strong>Key Competencies:</strong></span></p><ul><li><span>Strong technical proficiency and excellent working knowledge of various computer hardware technologies, software applications, mobile devices, and other technology products including audio visual (A/V) systems.</span></li><li><span>Ability to schedule, self-manage and prioritize requests from residents and staff.</span></li><li><span>Ability to quickly learn and utilize new technologies.</span></li><li><span>Excellent troubleshooting, break/fix skills.&nbsp; Persistence and follow-through required.</span></li><li><span>Outstanding customer service skills, especially with older adults.</span></li><li><span>Excellent verbal and written communication skills, along with effective listening. Strong people skills required for relationship building.</span></li><li><span>Ability to effectively create and teach in-person classroom and virtual training (in collaboration/partnership with Lifestyle team leaders).</span></li><li><span>Demonstrated ability to manage multiple, parallel assignments with accountability for timely delivery results.&nbsp; Ability to multi-task projects and assignments in a timely manner.</span></li></ul><p><span><strong>Education and Experience:</strong></span></p><p><span><strong>&nbsp;</strong></span></p><ul><li><span><strong>Education: </strong>Associate’s or Bachelor’s degree in Computer Science, Information Technology, or related technology field is preferred.</span></li><li><span><strong>Work Experience: &nbsp;</strong>Minimum 1 year of user support and training experience is required.</span></li></ul><ul><li><span>A solid working knowledge of computer hardware, software, and peripherals including installation, configuration, maintenance and support is required.</span></li></ul><ul><li><span><strong>Licensure / Certification: </strong>Microsoft, A+ or other technology certifications preferred.</span></li></ul> Pay Range: USD $33.01 - USD $41.27 /Hr.</p>",
    "name": "IT/AV Support Coordinator",
    "type": "external",
    "publication_date": "2025-04-10T03:49:58Z",
    "short_name": "itav-support-coordinator-7a7b3f",
    "model_type": "jobs",
    "id": 18471605,
    "locations": [
      {
        "name": "San Francisco, CA"
      }
    ],
    "categories": [
      {
        "name": "Computer and IT"
      }
    ],
    "levels": [
      {
        "name": "Mid Level",
        "short_name": "mid"
      }
    ],
    "tags": [],
    "refs": {
      "landing_page": "https://www.themuse.com/jobs/viliving/itav-support-coordinator-7a7b3f"
    },
    "company": {
      "id": 15000753,
      "short_name": "viliving",
      "name": "Vi Living"
    }
  }
